IDEA StatiCa Open Model
ConnectionSetup.ApplyBetapInfluence Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Apply βp influence in bolt shear resistance. ΕΝ 1993-1-8 chapter 3.6.1 (12)
 Namespace: IdeaRS.OpenModel
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public bool ApplyBetapInfluence { get; set; }
Public Property ApplyBetapInfluence As Boolean
	Get
	Set
public:
property bool ApplyBetapInfluence {
	bool get ();
	void set (bool value);
}
Property Value
Type: Boolean
See Also
Reference
ConnectionSetup Class
IdeaRS.OpenModel Namespace